// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6
// Решение  13 задачи должно быть выполнено без использования свойств строк

Console.WriteLine("Введите целое число: ");
int num = int.Parse(Console.ReadLine());



Console.WriteLine($"Третья цифра числа: {result}");
